Revit 2015 API
StairsRunType Properties
The StairsRunType type exposes the following members.
Properties
Name | Description
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
CanBeCopied
 Determine if this ElementType can create a copy
 (Inherited from ElementType.)
CanBeDeleted
 Determine if this ElementType can be deleted
 (Inherited from ElementType.)
CanBeRenamed
 Determine if this ElementType can be renamed
 (Inherited from ElementType.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
FamilyName
 Gets the family name of this element type.
 (Inherited from ElementType.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
HasRisers
 True if the stairs run will include risers on steps, false otherwise.
HasTreads
 True if the stairs run will include treads on steps, false otherwise.
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsMonolithic
 True if the stairs run is monolithic, false otherwise.
IsSlanted
 True if risers will be slanted, false if they will be straight.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
MaterialId
 The material of the stairs run, only available for monolithic stairs run.
Name
Set the name for the ElementType.
 (Inherited from ElementType.)
NosingLength
 The amount of the tread depth that overhangs the next tread.
NosingProfile
 The id of the nosing profile of the treads.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[String]
Retrieves a parameter from the element given its name.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
RiserProfile
 The id of the profile of the risers.
RiserThickness
 The thickness of the risers.
RiserToTreadConnect
 The connection of the riser to tread in relation to each other.
StructuralDepth
 The structural depth of the stairs run, only available for monolithic stairs run.
TotalDepth
 The total depth of the stairs run, only available for monolithic stairs run.
TreadNosingPosition
 Represents on which edges of the nosing to apply the nosing profile.
TreadProfile
 The id of the profile of the treads.
TreadThickness
 The thickness of the treads.
UndersideSurfaceStyle
 The underside surface style of the stairs run, only available for monolithic stairs run.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace